zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/periph/PERI_INTC.h
/*
** Start of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- INTC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INTC_Peripheral_Access_Layer INTC Peripheral Access Layer
 * @{
 */

/** INTC - Register Layout Typedef */
typedef struct {
  __IO uint16_t IPR0;                              /**< Interrupt Priority Register 0, offset: 0x0 */
  __IO uint16_t IPR1;                              /**< Interrupt Priority Register 1, offset: 0x1 */
  __IO uint16_t IPR2;                              /**< Interrupt Priority Register 2, offset: 0x2 */
  __IO uint16_t IPR3;                              /**< Interrupt Priority Register 3, offset: 0x3 */
  __IO uint16_t IPR4;                              /**< Interrupt Priority Register 4, offset: 0x4 */
  __IO uint16_t IPR5;                              /**< Interrupt Priority Register 5, offset: 0x5 */
  __IO uint16_t IPR6;                              /**< Interrupt Priority Register 6, offset: 0x6, not available in all instances (available on 18 out of 21) */
       uint16_t RESERVED_0[1];
  __IO uint16_t IPR8;                              /**< Interrupt Priority Register 8, offset: 0x8 */
  __IO uint16_t IPR9;                              /**< Interrupt Priority Register 9, offset: 0x9 */
  __IO uint16_t IPR10;                             /**< Interrupt Priority Register 10, offset: 0xA */
  __IO uint16_t IPR11;                             /**< Interrupt Priority Register 11, offset: 0xB */
  __IO uint16_t IPR12;                             /**< Interrupt Priority Register 12, offset: 0xC */
  __IO uint16_t VBA;                               /**< Vector Base Address Register, offset: 0xD */
  __IO uint16_t FIM0;                              /**< Fast Interrupt 0 Match Register, offset: 0xE */
  __IO uint16_t FIVAL0;                            /**< Fast Interrupt 0 Vector Address Low Register, offset: 0xF */
  __IO uint16_t FIVAH0;                            /**< Fast Interrupt 0 Vector Address High Register, offset: 0x10 */
  __IO uint16_t FIM1;                              /**< Fast Interrupt 1 Match Register, offset: 0x11 */
  __IO uint16_t FIVAL1;                            /**< Fast Interrupt 1 Vector Address Low Register, offset: 0x12 */
  __IO uint16_t FIVAH1;                            /**< Fast Interrupt 1 Vector Address High Register, offset: 0x13 */
  __I  uint16_t IRQP0;                             /**< IRQ Pending Register 0, offset: 0x14 */
  __I  uint16_t IRQP1;                             /**< IRQ Pending Register 1, offset: 0x15 */
  __I  uint16_t IRQP2;                             /**< IRQ Pending Register 2, offset: 0x16 */
  __I  uint16_t IRQP3;                             /**< IRQ Pending Register 3, offset: 0x17 */
  __I  uint16_t IRQP4;                             /**< IRQ Pending Register 4, offset: 0x18 */
  __I  uint16_t IRQP5;                             /**< IRQ Pending Register 5, offset: 0x19 */
  __I  uint16_t IRQP6;                             /**< IRQ Pending Register 6, offset: 0x1A */
  __IO uint16_t CTRL;                              /**< Control Register, offset: 0x1B */
} INTC_Type;

/* ----------------------------------------------------------------------------
   -- INTC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INTC_Register_Masks INTC Register Masks
 * @{
 */

/*! @name IPR0 - Interrupt Priority Register 0 */
/*! @{ */

#define INTC_IPR0_STPCNT_MASK                    (0x3U)
#define INTC_IPR0_STPCNT_SHIFT                   (0U)
/*! STPCNT - EOnCE Step Counter Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 1
 *  0b10..IRQ Priority Level 2
 *  0b11..IRQ Priority Level 3
 */
#define INTC_IPR0_STPCNT(x)                      (((uint16_t)(((uint16_t)(x)) << INTC_IPR0_STPCNT_SHIFT)) & INTC_IPR0_STPCNT_MASK)

#define INTC_IPR0_BKPT_MASK                      (0xCU)
#define INTC_IPR0_BKPT_SHIFT                     (2U)
/*! BKPT - EOnCE Breakpoint Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 1
 *  0b10..IRQ Priority Level 2
 *  0b11..IRQ Priority Level 3
 */
#define INTC_IPR0_BKPT(x)                        (((uint16_t)(((uint16_t)(x)) << INTC_IPR0_BKPT_SHIFT)) & INTC_IPR0_BKPT_MASK)

#define INTC_IPR0_TRBUF_MASK                     (0x30U)
#define INTC_IPR0_TRBUF_SHIFT                    (4U)
/*! TRBUF - EOnCE Trace Buffer Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 1
 *  0b10..IRQ Priority Level 2
 *  0b11..IRQ Priority Level 3
 */
#define INTC_IPR0_TRBUF(x)                       (((uint16_t)(((uint16_t)(x)) << INTC_IPR0_TRBUF_SHIFT)) & INTC_IPR0_TRBUF_MASK)

#define INTC_IPR0_TX_REG_MASK                    (0xC0U)
#define INTC_IPR0_TX_REG_SHIFT                   (6U)
/*! TX_REG - EOnCE Transmit Register Empty Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 1
 *  0b10..IRQ Priority Level 2
 *  0b11..IRQ Priority Level 3
 */
#define INTC_IPR0_TX_REG(x)                      (((uint16_t)(((uint16_t)(x)) << INTC_IPR0_TX_REG_SHIFT)) & INTC_IPR0_TX_REG_MASK)

#define INTC_IPR0_RX_REG_MASK                    (0x300U)
#define INTC_IPR0_RX_REG_SHIFT                   (8U)
/*! RX_REG - EOnCE Receive Register Full Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 1
 *  0b10..IRQ Priority Level 2
 *  0b11..IRQ Priority Level 3
 */
#define INTC_IPR0_RX_REG(x)                      (((uint16_t)(((uint16_t)(x)) << INTC_IPR0_RX_REG_SHIFT)) & INTC_IPR0_RX_REG_MASK)

#define INTC_IPR0_BUS_ERR_MASK                   (0xC00U)
#define INTC_IPR0_BUS_ERR_SHIFT                  (10U)
/*! BUS_ERR - Bus Error Interrupt Priority Level
 *  0b00..IRQ disabled (default)
 *  0b01..IRQ Priority Level 1
 *  0b10..IRQ Priority Level 2
 *  0b11..IRQ Priority Level 3
 */
#define INTC_IPR0_BUS_ERR(x)                     (((uint16_t)(((uint16_t)(x)) << INTC_IPR0_BUS_ERR_SHIFT)) & INTC_IPR0_BUS_ERR_MASK)
/*! @} */

/*! @name IPR1 - Interrupt Priority Register 1 */
/*! @{ */

